---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/rayansud/SEARCH/logs/bivar_velocity.log
  log type:  text
 opened on:   7 Jun 2021, 04:48:28

. 
. use data/clean_data.dta

. 
. ******Bivariate correlation checks****
. regress growth_vel mage

      Source |       SS           df       MS      Number of obs   =     7,802
-------------+----------------------------------   F(1, 7800)      =     25.40
       Model |  502.522678         1  502.522678   Prob > F        =    0.0000
    Residual |  154344.027     7,800  19.7876958   R-squared       =    0.0032
-------------+----------------------------------   Adj R-squared   =    0.0031
       Total |   154846.55     7,801   19.849577   Root MSE        =    4.4483

------------------------------------------------------------------------------
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mage |  -.0763064   .0151419    -5.04   0.000    -.1059886   -.0466242
       _cons |   10.09739   .3535516    28.56   0.000     9.404329    10.79044
------------------------------------------------------------------------------

. regress growth_vel gage

      Source |       SS           df       MS      Number of obs   =     7,742
-------------+----------------------------------   F(1, 7740)      =      0.00
       Model |  .075913991         1  .075913991   Prob > F        =    0.9506
    Residual |  153267.621     7,740  19.8020183   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |  153267.697     7,741    19.79947   Root MSE        =    4.4499

------------------------------------------------------------------------------
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        gage |   .0015555   .0251229     0.06   0.951    -.0476921    .0508031
       _cons |   8.268146    .992822     8.33   0.000     6.321946    10.21435
------------------------------------------------------------------------------

. regress growth_vel dt_birth

      Source |       SS           df       MS      Number of obs   =     7,677
-------------+----------------------------------   F(1, 7675)      =     26.58
       Model |  525.708694         1  525.708694   Prob > F        =    0.0000
    Residual |  151791.594     7,675  19.7774063   R-squared       =    0.0035
-------------+----------------------------------   Adj R-squared   =    0.0033
       Total |  152317.302     7,676  19.8433171   Root MSE        =    4.4472

------------------------------------------------------------------------------
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    dt_birth |   2.54e-12   4.93e-13     5.16   0.000     1.58e-12    3.51e-12
       _cons |   4.916492   .6652216     7.39   0.000     3.612476    6.220508
------------------------------------------------------------------------------

. 
. ttest growth_vel,by(sex)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    male |   3,934    8.673499    .0734233    4.605227    8.529548     8.81745
  female |   3,873    7.988122    .0683266    4.252201    7.854163    8.122082
---------+--------------------------------------------------------------------
combined |   7,807    8.333488    .0503247     4.44655    8.234838    8.432138
---------+--------------------------------------------------------------------
    diff |             .685377    .1003595                .4886455    .8821085
------------------------------------------------------------------------------
    diff = mean(male) - mean(female)                              t =   6.8292
Ho: diff = 0                                     degrees of freedom =     7805

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. oneway growth_vel m_edu4,tabulate

   Maternal |    Summary of Growth velocity in
  Educ in 4 |               kg/g/d
 Categories |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Illiterat |   7.8709068   4.4181144       2,164
  1-4/Liter |    8.248972   4.2466313         635
       5-10 |    8.463335   4.5451162       3,823
       >=11 |    8.814664   4.2634867       1,175
------------+------------------------------------
      Total |   8.3343978   4.4553845       7,797

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      804.089944      3   268.029981     13.57     0.0000
 Within groups      153950.023   7793   19.7549113
------------------------------------------------------------------------
    Total           154754.113   7796   19.8504507

Bartlett's test for equal variances:  chi2(3) =  10.5387  Prob>chi2 = 0.015

. oneway growth_vel f_edu4,tabulate

   Paternal |    Summary of Growth velocity in
  Educ in 4 |               kg/g/d
 Categories |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Illiterat |   7.8929753   4.4352905       1,486
  1-4/Liter |   8.0062795   4.3095942       1,020
       5-10 |   8.4794702   4.5000182       3,358
       >=11 |   8.5966829   4.4424453       1,909
------------+------------------------------------
      Total |   8.3340403   4.4567785       7,773

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      601.365955      3   200.455318     10.13     0.0000
 Within groups      153772.897   7769    19.793139
------------------------------------------------------------------------
    Total           154374.263   7772   19.8628748

Bartlett's test for equal variances:  chi2(3) =   2.9377  Prob>chi2 = 0.401

. oneway growth_vel grav4,tabulate

  Gravidity |    Summary of Growth velocity in
       in 4 |               kg/g/d
 Categories |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   1st preg |   8.4558477    4.625883       2,969
   2nd preg |    8.464484   4.4380084       2,757
   3rd preg |   8.2440469   4.2546002       1,337
   >=4 preg |   7.5297504   4.0845361         743
------------+------------------------------------
      Total |   8.3344721   4.4554722       7,806

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      582.423292      3   194.141097      9.81     0.0000
 Within groups      154356.446   7802    19.784215
------------------------------------------------------------------------
    Total           154938.869   7805   19.8512324

Bartlett's test for equal variances:  chi2(3) =  24.7150  Prob>chi2 = 0.000

. oneway growth_vel para5,tabulate

            |    Summary of Growth velocity in
Parity in 5 |               kg/g/d
 Categories |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  0 childre |   8.4196925   4.6523102       3,094
    1 child |   8.5351945    4.379828       2,810
  2 childre |   8.0790967    4.198663       1,270
  3 childre |   7.5447504   3.9658732         435
  >=4 child |   7.5216412   4.6159927         207
------------+------------------------------------
      Total |   8.3333961   4.4541082       7,816

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      626.555623      4   156.638906      7.92     0.0000
 Within groups      154415.857   7811   19.7690253
------------------------------------------------------------------------
    Total           155042.412   7815   19.8390803

Bartlett's test for equal variances:  chi2(4) =  33.4690  Prob>chi2 = 0.000

. oneway growth_vel year_birth,tabulate

            |    Summary of Growth velocity in
            |               kg/g/d
 year_birth |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       1996 |   8.6890962    5.700898         239
       1997 |   8.0058585     4.27978         419
       1998 |   7.9696681   4.3751975         637
       1999 |   7.6547892    4.164231         789
       2000 |   8.0802954   4.6483101         846
       2001 |   8.3217005   3.7610632         572
       2002 |   8.2614848   4.1421213         704
       2003 |   8.3675277    4.520454         611
       2004 |   8.8408122    4.439344         645
       2005 |   8.6068087   4.8058324         692
       2006 |   8.7046803   4.3119594         743
       2007 |   8.8292035   4.6748495         649
       2008 |    8.159092   4.4303353         131
------------+------------------------------------
      Total |   8.3361795   4.4545838       7,677

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      1065.11298     12   88.7594154      4.50     0.0000
 Within groups      151252.189   7664   19.7354109
------------------------------------------------------------------------
    Total           152317.302   7676   19.8433171

Bartlett's test for equal variances:  chi2(12) =  95.6238  Prob>chi2 = 0.000

. oneway growth_vel n_preg_visits,tabulate

            |    Summary of Growth velocity in
n_preg_visi |               kg/g/d
         ts |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   0 visits |   8.1393471   4.6540765       1,325
    1 visit |   7.5284557   4.8504174         610
   2 visits |   8.4896617   4.2889009       2,863
   3 visits |   8.4330449   4.4164163       3,018
------------+------------------------------------
      Total |   8.3333961   4.4541082       7,816

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      545.009439      3   181.669813      9.19     0.0000
 Within groups      154497.403   7812   19.7769333
------------------------------------------------------------------------
    Total           155042.412   7815   19.8390803

Bartlett's test for equal variances:  chi2(3) =  22.9967  Prob>chi2 = 0.000

. 
. ttest growth_vel ,by(bi_asph)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     793    8.558866    .1665614    4.690411    8.231912     8.88582
      no |   7,023    8.307937    .0528172    4.426262    8.204399    8.411475
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |            .2509288    .1668476               -.0761372    .5779948
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =   1.5039
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9337         Pr(|T| > |t|) = 0.1326          Pr(T > t) = 0.0663

. ttest growth_vel ,by(neo_sep)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     711    7.929276    .1918095    5.114519    7.552694    8.305857
      no |   7,105    8.373837    .0519735    4.380905    8.271953     8.47572
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.4445608    .1751399               -.7878818   -.1012398
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -2.5383
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0056         Pr(|T| > |t|) = 0.0112          Pr(T > t) = 0.9944

. ttest growth_vel ,by(hemo)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |      39     7.16002     .815368    5.091972    5.509394    8.810647
      no |   7,777     8.33928    .0504639    4.450274    8.240358    8.438203
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |            -1.17926    .7149355               -2.580725     .222205
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -1.6495
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0495         Pr(|T| > |t|) = 0.0991          Pr(T > t) = 0.9505

. ttest growth_vel ,by(twin)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |      98    7.332099    .5672244    5.615235    6.206316    8.457883
      no |   7,718     8.34611    .0504987    4.436417    8.247119    8.445101
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -1.014011     .452664               -1.901354   -.1266683
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -2.2401
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0126         Pr(|T| > |t|) = 0.0251          Pr(T > t) = 0.9874

. ttest growth_vel ,by(hypo)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     402    8.112992    .2941417    5.897523     7.53474    8.691245
      no |   7,414    8.345347    .0506642    4.362421    8.246031    8.444663
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.2323545    .2280934               -.6794786    .2147695
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -1.0187
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1542         Pr(|T| > |t|) = 0.3084          Pr(T > t) = 0.8458

. ttest growth_vel ,by(u_fev)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     343    8.479726    .2695799     4.99269    7.949482    9.009969
      no |   7,473     8.32668    .0512233    4.428073    8.226268    8.427092
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |            .1530458    .2459663               -.3291139    .6352055
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =   0.6222
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7331         Pr(|T| > |t|) = 0.5338          Pr(T > t) = 0.2669

. ttest growth_vel ,by(fdpr_m)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     391    7.554863    .2687686    5.314554    7.026446    8.083279
      no |   7,425    8.374394    .0510715    4.400749    8.274279    8.474508
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.8195311    .2309375                -1.27223   -.3668317
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -3.5487
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0002         Pr(|T| > |t|) = 0.0004          Pr(T > t) = 0.9998

. ttest growth_vel ,by(fdpr_b)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     728    7.770374    .1994186    5.380609    7.378869    8.161879
      no |   7,088    8.391223    .0515987    4.344106    8.290075    8.492372
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.6208494    .1732194               -.9604058    -.281293
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -3.5842
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0002         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.9998

. ttest growth_vel ,by(conj)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |      91    9.166049    .5410917    5.161686    8.091075    10.24102
      no |   7,725    8.323588    .0505684    4.444559     8.22446    8.422715
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |            .8424611    .4695928               -.0780665    1.762989
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =   1.7940
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9636         Pr(|T| > |t|) = 0.0728          Pr(T > t) = 0.0364

. ttest growth_vel ,by(bsi)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     261    8.440202    .2932886    4.738223    7.862678    9.017725
      no |   7,555    8.329706    .0511307    4.444256    8.229476    8.429937
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |            .1104956    .2804394               -.4392407    .6602319
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =   0.3940
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6532         Pr(|T| > |t|) = 0.6936          Pr(T > t) = 0.3468

. ttest growth_vel ,by(abjaun)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |      37    8.299041    .7983885    4.856407    6.679834    9.918247
      no |   7,779     8.33356     .050482    4.452448    8.234601    8.432518
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.0345189    .7340371               -1.473428     1.40439
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -0.0470
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4812         Pr(|T| > |t|) = 0.9625          Pr(T > t) = 0.5188

. ttest growth_vel ,by(jaun)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     128    9.149507    .4064386    4.598328    8.345239    9.953776
      no |   7,688    8.319808    .0507601     4.45071    8.220305    8.419312
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |             .829699    .3968695                .0517285    1.607669
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =   2.0906
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9817         Pr(|T| > |t|) = 0.0366          Pr(T > t) = 0.0183

. ttest growth_vel ,by(pnm)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     107    9.394095    .4479606     4.63374     8.50597    10.28222
      no |   7,709    8.318674     .050684    4.450098    8.219319    8.418028
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |            1.075422    .4334299                 .225783     1.92506
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =   2.4812
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9934         Pr(|T| > |t|) = 0.0131          Pr(T > t) = 0.0066

. ttest growth_vel ,by(uri)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     120    8.140148    .3617192    3.962435    7.423908    8.856388
      no |   7,696    8.336409    .0508568    4.461509    8.236716    8.436103
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.1962612    .4097805               -.9995407    .6070183
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -0.4789
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3160         Pr(|T| > |t|) = 0.6320          Pr(T > t) = 0.6840

. ttest growth_vel ,by(umb_sep)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     yes |     155    8.000561    .3633324    4.523452    7.282802     8.71832
      no |   7,661     8.34013    .0508726    4.452737    8.240406    8.439854
---------+--------------------------------------------------------------------
combined |   7,816    8.333396    .0503812    4.454108    8.234635    8.432157
---------+--------------------------------------------------------------------
    diff |           -.3395691    .3613664               -1.047944    .3688056
------------------------------------------------------------------------------
    diff = mean(yes) - mean(no)                                   t =  -0.9397
Ho: diff = 0                                     degrees of freedom =     7814

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1737         Pr(|T| > |t|) = 0.3474          Pr(T > t) = 0.8263

. 
. 
. **Bivar statistic graphs
. graph twoway (lfitci growth_vel mage) (scatter growth_vel mage),xtitle("Maternal Age (years)") ytitle("Neonatal Growth Velocity, D1-28") title("Neonatal Growth Velocity vs. Maternal Age")

. graph export graphs/vel_bivar_mage.eps,replace
(note: file graphs/vel_bivar_mage.eps not found)
(file graphs/vel_bivar_mage.eps written in EPS format)

. graph twoway (lfitci growth_vel gage) (scatter growth_vel gage),xtitle("Gestational Age (weeks)") ytitle("Neonatal Growth Velocity, D1-28") title("Neonatal Growth Velocity vs. Gestational Age")

. 
. graph export graphs/vel_bivar_wt1.eps,replace
(note: file graphs/vel_bivar_wt1.eps not found)
(file graphs/vel_bivar_wt1.eps written in EPS format)

. graph twoway (lfitci growth_vel dt_birth) (scatter growth_vel dt_birth),xtitle("Date of Birth") ytitle("Neonatal Growth Velocity, D1-28") title("Neonatal Growth Velocity vs. Date of Birth")

. graph export graphs/vel_bivar_dtbirth.eps,replace
(note: file graphs/vel_bivar_dtbirth.eps not found)
(file graphs/vel_bivar_dtbirth.eps written in EPS format)

. 
. graph bar growth_vel,over(sex) b1title("Neonate Sex") ytitle("Mean Neonatal Growth Velocity, D1-28 (kg/g/day)") title("Neonatal Growth Velocity by Sex")

. graph export graphs/vel_bivar_sex.eps,replace
(note: file graphs/vel_bivar_sex.eps not found)
(file graphs/vel_bivar_sex.eps written in EPS format)

. graph bar growth_vel ,over(m_edu4) b1title("Mother's Education") ytitle("Mean Neonatal Growth Velocity, D1-28 (kg/g/day)") title("Neonatal Growth Velocity by Mother's Education")

. graph export graphs/vel_bivar_m_edu.eps,replace
(note: file graphs/vel_bivar_m_edu.eps not found)
(file graphs/vel_bivar_m_edu.eps written in EPS format)

. graph bar growth_vel ,over(f_edu4) b1title("Father's Education") ytitle("Mean Neonatal Growth Velocity, D1-28 (kg/g/day)") title("Neonatal Growth Velocity by Mother's Education")

. graph export graphs/vel_bivar_f_edu.eps,replace
(note: file graphs/vel_bivar_f_edu.eps not found)
(file graphs/vel_bivar_f_edu.eps written in EPS format)

