-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/rayansud/SEARCH/logs/multivar_velocity.log
  log type:  text
 opened on:   8 Jun 2021, 23:37:22

. use data/clean_data.dta

. 
. **********Analysis: Regressions***********
. **Computing regression table
. 
. eststo gvel_regtable:reg growth_vel sex mage i.m_edu4 i.f_edu4 i.para5 prev_s
> t hypo conj hemo fdpr_m fdpr_b jaun pnm twin n_preg_visits year_birth,vce(rob
> ust)

Linear regression                               Number of obs     =      7,608
                                                F(23, 7584)       =       6.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0205
                                                Root MSE          =     4.4152

------------------------------------------------------------------------------
             |               Robust
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |  -.6716431   .1016575    -6.61   0.000    -.8709199   -.4723663
        mage |  -.0591764   .0210224    -2.81   0.005     -.100386   -.0179668
             |
      m_edu4 |
1-4/Liter~e  |   .1754619   .1978537     0.89   0.375    -.2123862      .56331
       5-10  |   .1541595   .1492502     1.03   0.302    -.1384122    .4467312
       >=11  |    .454675   .2056516     2.21   0.027      .051541     .857809
             |
      f_edu4 |
1-4/Liter~e  |   .0305572   .1810641     0.17   0.866    -.3243786     .385493
       5-10  |   .2710207   .1547307     1.75   0.080    -.0322942    .5743356
       >=11  |     .18507   .1904112     0.97   0.331    -.1881887    .5583287
             |
       para5 |
    1 child  |    .319648   .1331422     2.40   0.016     .0586525    .5806435
 2 children  |   .1398284   .1830407     0.76   0.445     -.218982    .4986387
 3 children  |  -.1648927   .2558429    -0.64   0.519    -.6664156    .3366302
>=4 child..  |   .2136129   .3871753     0.55   0.581    -.5453578    .9725836
             |
     prev_st |    .283867    .218215     1.30   0.193    -.1438949    .7116288
        hypo |  -.1191643   .3025791    -0.39   0.694     -.712303    .4739745
        conj |  -.7031358   .5459042    -1.29   0.198    -1.773259    .3669876
        hemo |   .7957608   .8140071     0.98   0.328    -.7999185     2.39144
      fdpr_m |   .6685415   .2759875     2.42   0.015     .1275297    1.209553
      fdpr_b |   .5104561   .2099402     2.43   0.015     .0989152     .921997
        jaun |   -.464483   .3944046    -1.18   0.239    -1.237625    .3086591
         pnm |  -.9962697   .4456534    -2.24   0.025    -1.869874   -.1226656
        twin |   .7157602   .5619594     1.27   0.203    -.3858359    1.817356
n_preg_vis~s |   .0651959    .052006     1.25   0.210    -.0367504    .1671421
  year_birth |   .0433295   .0183814     2.36   0.018     .0072969    .0793621
       _cons |  -77.91204    36.6783    -2.12   0.034    -149.8117   -6.012423
------------------------------------------------------------------------------

. eststo gvel_regtable_gage:reg growth_vel sex mage gage i.m_edu4 i.f_edu4 i.pa
> ra5 prev_st hypo conj hemo fdpr_m fdpr_b jaun pnm twin n_preg_visits year_bir
> th,vce(robust)

Linear regression                               Number of obs     =      7,538
                                                F(24, 7513)       =       6.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0202
                                                Root MSE          =     4.4112

------------------------------------------------------------------------------
             |               Robust
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |  -.6496746   .1021942    -6.36   0.000    -.8500039   -.4493452
        mage |  -.0600702   .0210386    -2.86   0.004    -.1013118   -.0188286
        gage |  -.0178141    .027706    -0.64   0.520    -.0721255    .0364974
             |
      m_edu4 |
1-4/Liter~e  |   .1706489   .2002234     0.85   0.394     -.221845    .5631427
       5-10  |   .1398265   .1495558     0.93   0.350    -.1533447    .4329977
       >=11  |    .452485   .2067573     2.19   0.029     .0471828    .8577871
             |
      f_edu4 |
1-4/Liter~e  |   .0372566   .1822747     0.20   0.838    -.3200527     .394566
       5-10  |   .2889218    .154888     1.87   0.062    -.0147021    .5925456
       >=11  |   .2109669   .1907068     1.11   0.269    -.1628719    .5848056
             |
       para5 |
    1 child  |   .3139089   .1336723     2.35   0.019     .0518737    .5759441
 2 children  |   .1656248   .1843467     0.90   0.369    -.1957463    .5269959
 3 children  |  -.1968278   .2569541    -0.77   0.444    -.7005297    .3068742
>=4 child..  |    .236805   .3952328     0.60   0.549    -.5379619    1.011572
             |
     prev_st |   .2968956   .2200626     1.35   0.177    -.1344886    .7282799
        hypo |  -.0739695   .3050471    -0.24   0.808    -.6719471    .5240082
        conj |  -.5160511   .5139062    -1.00   0.315    -1.523451    .4913487
        hemo |   .7861514   .8129076     0.97   0.334    -.8073749    2.379678
      fdpr_m |   .7180079   .2706678     2.65   0.008     .1874232    1.248593
      fdpr_b |   .5161593   .2079824     2.48   0.013     .1084555     .923863
        jaun |  -.3757705   .3827525    -0.98   0.326    -1.126072    .3745314
         pnm |  -.9734996    .448779    -2.17   0.030    -1.853232   -.0937672
        twin |   .7134482   .5699863     1.25   0.211    -.4038844    1.830781
n_preg_vis~s |   .0616635   .0521445     1.18   0.237    -.0405542    .1638813
  year_birth |   .0434122   .0183306     2.37   0.018      .007479    .0793454
       _cons |  -77.76099   36.54355    -2.13   0.033    -149.3966    -6.12541
------------------------------------------------------------------------------

. 
. *Check normality of residuals
. predict r, resid
(278 missing values generated)

. kdensity r, normal title("Regression Residuals Normality")

. graph export graphs/vel_norm_resid.eps,replace
(note: file graphs/vel_norm_resid.eps not found)
(file graphs/vel_norm_resid.eps written in EPS format)

. 
. *Check VIF 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
         sex |      1.01    0.994638
        mage |      1.91    0.523122
        gage |      1.03    0.974463
      m_edu4 |
          1  |      1.25    0.802099
          2  |      2.18    0.459435
          3  |      2.15    0.464742
      f_edu4 |
          1  |      1.52    0.659341
          2  |      2.33    0.429548
          3  |      2.59    0.386685
       para5 |
          1  |      1.56    0.642695
          2  |      1.84    0.544490
          3  |      1.54    0.648214
          4  |      1.41    0.708956
     prev_st |      1.12    0.895931
        hypo |      1.08    0.929095
        conj |      1.33    0.753544
        hemo |      1.01    0.994339
      fdpr_m |      1.05    0.950165
      fdpr_b |      1.09    0.921588
        jaun |      1.32    0.757438
         pnm |      1.00    0.995613
        twin |      1.02    0.978492
n_preg_vis~s |      1.19    0.841760
  year_birth |      1.37    0.728629
-------------+----------------------
    Mean VIF |      1.45

. 
. *Imputation adjusted regression
. mdesc

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
           srno |           0          7,816           0.00
         bplace |           0          7,816           0.00
         grav_m |          74          7,816           0.95
         grav_d |           0          7,816           0.00
            dt1 |           3          7,816           0.04
            wt1 |           0          7,816           0.00
            dt7 |          16          7,816           0.20
            wt7 |         750          7,816           9.60
           dt15 |          22          7,816           0.28
           wt15 |         326          7,816           4.17
           dt28 |           4          7,816           0.05
           wt28 |           0          7,816           0.00
         reg_dt |           3          7,816           0.04
           mage |          14          7,816           0.18
          m_edu |          19          7,816           0.24
          f_edu |          43          7,816           0.55
           grav |          10          7,816           0.13
           para |           0          7,816           0.00
            lmp |          76          7,816           0.97
        prev_st |           0          7,816           0.00
         dt_hv1 |       1,302          7,816          16.66
         dt_hv2 |       1,891          7,816          24.19
         dt_hv3 |       4,721          7,816          60.40
            sex |           9          7,816           0.12
          still |           0          7,816           0.00
           twin |           0          7,816           0.00
        bi_asph |           0          7,816           0.00
           cong |           0          7,816           0.00
        neo_sep |           0          7,816           0.00
           hemo |           0          7,816           0.00
           conj |           0          7,816           0.00
            bsi |           0          7,816           0.00
         abjaun |           0          7,816           0.00
           jaun |           0          7,816           0.00
            pnm |           0          7,816           0.00
            uri |           0          7,816           0.00
           hypo |           0          7,816           0.00
        umb_sep |           0          7,816           0.00
          u_fev |           0          7,816           0.00
         fdpr_m |           0          7,816           0.00
         fdpr_b |           0          7,816           0.00
       dt_birth |         139          7,816           1.78
         fpr_d1 |           0          7,816           0.00
          hr_d1 |       4,722          7,816          60.41
     year_birth |         139          7,816           1.78
          wt1_g |           0          7,816           0.00
          wt7_g |         750          7,816           9.60
         wt15_g |         326          7,816           4.17
         wt28_g |           0          7,816           0.00
        chwt_17 |         750          7,816           9.60
       chwt_715 |         885          7,816          11.32
      chwt_1528 |         326          7,816           4.17
       chwt_128 |           0          7,816           0.00
     growth_vel |           0          7,816           0.00
           gage |          74          7,816           0.95
         m_edu4 |          19          7,816           0.24
         f_edu4 |          43          7,816           0.55
          grav4 |          10          7,816           0.13
          para5 |           0          7,816           0.00
         d_mage |          14          7,816           0.18
         d_gage |          74          7,816           0.95
   n_preg_vis~s |           0          7,816           0.00
   morbidity_~m |           0          7,816           0.00
   _est_gvel~le |           0          7,816           0.00
   _est_gvel~ge |           0          7,816           0.00
              r |         278          7,816           3.56
----------------+-----------------------------------------------

. 
. mi set mlong

. mi register imputed growth_vel mage gage sex m_edu4 f_edu4 para5 prev_st hypo
>  conj hemo fdpr_m fdpr_b jaun pnm twin n_preg_visits year_birth morbidity_num
(278 m=0 obs. now marked as incomplete)

. 
. mi impute chained (regress) growth_vel year_birth mage gage (logit) sex prev_
> st hypo jaun conj fdpr_m fdpr_b pnm twin (mlogit) m_edu4 f_edu4 (ologit) para
> 5 n_preg_visits,add(10) rseed(12345) augment
note: variables growth_vel prev_st hypo jaun conj fdpr_m fdpr_b pnm twin
      para5 n_preg_visits contain no soft missing (.) values; imputing
      nothing

Conditional models:
               sex: logit sex growth_vel i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     mage i.m_edu4 i.f_edu4 gage year_birth , augment
              mage: regress mage growth_vel i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex i.m_edu4 i.f_edu4 gage year_birth
            m_edu4: mlogit m_edu4 growth_vel i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex mage i.f_edu4 gage year_birth , augment
            f_edu4: mlogit f_edu4 growth_vel i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex mage i.m_edu4 gage year_birth , augment
              gage: regress gage growth_vel i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex mage i.m_edu4 i.f_edu4 year_birth
        year_birth: regress year_birth growth_vel i.prev_st i.hypo i.jaun
                     i.conj i.fdpr_m i.fdpr_b i.pnm i.twin i.para5
                     i.n_preg_visits i.sex mage i.m_edu4 i.f_edu4 gage

Performing chained iterations ...

Multivariate imputation                     Imputations =       10
Chained equations                                 added =       10
Imputed: m=1 through m=10                       updated =        0

Initialization: monotone                     Iterations =      100
                                                burn-in =       10

        growth_vel: linear regression
        year_birth: linear regression
              mage: linear regression
              gage: linear regression
               sex: logistic regression
           prev_st: logistic regression
              hypo: logistic regression
              jaun: logistic regression
              conj: logistic regression
            fdpr_m: logistic regression
            fdpr_b: logistic regression
               pnm: logistic regression
              twin: logistic regression
            m_edu4: multinomial logistic regression
            f_edu4: multinomial logistic regression
             para5: ordered logistic regression
     n_preg_visits: ordered logistic regression

------------------------------------------------------------------
                   |               Observations per m             
                   |----------------------------------------------
          Variable |   Complete   Incomplete   Imputed |     Total
-------------------+-----------------------------------+----------
        growth_vel |       7816            0         0 |      7816
        year_birth |       7677          139       139 |      7816
              mage |       7802           14        14 |      7816
              gage |       7742           74        74 |      7816
               sex |       7807            9         9 |      7816
           prev_st |       7816            0         0 |      7816
              hypo |       7816            0         0 |      7816
              jaun |       7816            0         0 |      7816
              conj |       7816            0         0 |      7816
            fdpr_m |       7816            0         0 |      7816
            fdpr_b |       7816            0         0 |      7816
               pnm |       7816            0         0 |      7816
              twin |       7816            0         0 |      7816
            m_edu4 |       7797           19        19 |      7816
            f_edu4 |       7773           43        43 |      7816
             para5 |       7816            0         0 |      7816
     n_preg_visits |       7816            0         0 |      7816
------------------------------------------------------------------
(complete + incomplete = total; imputed is the minimum across m
 of the number of filled-in observations.)

. 
. eststo mi_gvel_morb: mi estimate,nosmall post: reg growth_vel mage gage i.sex
>   i.m_edu4 i.f_edu4 i.para5 n_preg_visits year_birth morbidity_num,vce(robust
> )

Multiple-imputation estimates                   Imputations       =         10
Linear regression                               Number of obs     =      7,816
                                                Average RVI       =     0.0041
                                                Largest FMI       =     0.0208
                                                Complete DF       =       7799
DF adjustment:   Large sample                   DF:     min       =  21,089.62
                                                        avg       =   2.75e+07
                                                        max       =   2.55e+08
Model F test:       Equal FMI                   F(  16, 7.1e+06)  =       8.11
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mage |  -.0623805    .020862    -2.99   0.003    -.1032693   -.0214918
        gage |  -.0099738   .0274783    -0.36   0.717    -.0638318    .0438842
             |
         sex |
     female  |  -.6838916   .1004455    -6.81   0.000    -.8807613   -.4870219
             |
      m_edu4 |
1-4/Liter~e  |   .1847316    .195965     0.94   0.346    -.1993539     .568817
       5-10  |   .1614459   .1476163     1.09   0.274    -.1278778    .4507696
       >=11  |   .4708881   .2034601     2.31   0.021     .0721118    .8696643
             |
      f_edu4 |
1-4/Liter~e  |   .0353112      .1787     0.20   0.843    -.3149347     .385557
       5-10  |   .2846891   .1531933     1.86   0.063    -.0155658     .584944
       >=11  |   .2156629   .1885127     1.14   0.253    -.1538161     .585142
             |
       para5 |
    1 child  |   .3406551   .1313187     2.59   0.009     .0832751    .5980351
 2 children  |   .1423005   .1775217     0.80   0.423    -.2056357    .4902367
 3 children  |  -.1915363   .2454081    -0.78   0.435    -.6725273    .2894546
>=4 child..  |  -.0205123    .373308    -0.05   0.956    -.7521825     .711158
             |
n_preg_vis~s |   .0521495   .0513761     1.02   0.310     -.048546    .1528449
  year_birth |   .0399648    .018362     2.18   0.030      .003974    .0759556
morbidity_~m |   .0970267   .0603427     1.61   0.108    -.0212428    .2152962
       _cons |  -71.67914   36.58322    -1.96   0.050    -143.3851    .0267669
------------------------------------------------------------------------------

. 
. eststo mi_gvel: mi estimate,nosmall post: reg growth_vel mage i.sex  i.m_edu4
>  i.f_edu4 i.para5 i.prev_st i.hypo i.conj i.hemo i.fdpr_m i.fdpr_b i.jaun i.p
> nm i.twin n_preg_visits year_birth,vce(robust)

Multiple-imputation estimates                   Imputations       =         10
Linear regression                               Number of obs     =      7,816
                                                Average RVI       =     0.0022
                                                Largest FMI       =     0.0194
                                                Complete DF       =       7792
DF adjustment:   Large sample                   DF:     min       =  24,034.91
                                                        avg       =   1.82e+10
                                                        max       =   2.71e+11
Model F test:       Equal FMI                   F(  23, 3.9e+07)  =       6.80
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mage |  -.0634433   .0207835    -3.05   0.002    -.1041783   -.0227084
             |
         sex |
     female  |  -.6698085   .1004955    -6.67   0.000    -.8667763   -.4728407
             |
      m_edu4 |
1-4/Liter~e  |   .1932759   .1944724     0.99   0.320    -.1878843     .574436
       5-10  |   .1498917   .1473715     1.02   0.309    -.1389523    .4387356
       >=11  |   .4437687   .2035546     2.18   0.029      .044807    .8427303
             |
      f_edu4 |
1-4/Liter~e  |   .0207516   .1789137     0.12   0.908    -.3299131    .3714163
       5-10  |    .280984   .1531178     1.84   0.066     -.019123     .581091
       >=11  |   .2109945   .1884154     1.12   0.263    -.1582937    .5802828
             |
       para5 |
    1 child  |   .3200367   .1315101     2.43   0.015     .0622816    .5777919
 2 children  |    .147831   .1793931     0.82   0.410    -.2037731    .4994351
 3 children  |  -.1523668   .2504131    -0.61   0.543    -.6431675    .3384339
>=4 child..  |   .0830399   .3859197     0.22   0.830    -.6733488    .8394287
             |
     prev_st |
         no  |   .2764344   .2156137     1.28   0.200    -.1461608    .6990295
             |
        hypo |
         no  |  -.2139071   .2957121    -0.72   0.469    -.7934921     .365678
             |
        conj |
         no  |  -.7081159   .5374277    -1.32   0.188    -1.761455     .345223
             |
        hemo |
         no  |   .9969196   .7855763     1.27   0.204    -.5427817    2.536621
             |
      fdpr_m |
         no  |   .6105315   .2691522     2.27   0.023     .0830028     1.13806
             |
      fdpr_b |
         no  |   .5399532   .2085779     2.59   0.010      .131148    .9487584
             |
        jaun |
         no  |  -.4555542   .3918329    -1.16   0.245    -1.223533    .3124242
             |
         pnm |
         no  |  -.9434788   .4471813    -2.11   0.035    -1.819938   -.0670196
             |
        twin |
         no  |    .715341   .5621016     1.27   0.203    -.3863578     1.81704
n_preg_vis~s |   .0527632   .0513348     1.03   0.304    -.0478511    .1533776
  year_birth |   .0430809   .0183002     2.35   0.019     .0072113    .0789504
       _cons |  -77.43119   36.50728    -2.12   0.034    -148.9877   -5.874653
------------------------------------------------------------------------------

. 
. eststo mi_gvel_gage: mi estimate,nosmall post: reg growth_vel mage gage i.sex
>   i.m_edu4 i.f_edu4 i.para5 i.prev_st i.hypo i.conj i.hemo i.fdpr_m i.fdpr_b 
> i.jaun i.pnm i.twin n_preg_visits year_birth,vce(robust)

Multiple-imputation estimates                   Imputations       =         10
Linear regression                               Number of obs     =      7,816
                                                Average RVI       =     0.0028
                                                Largest FMI       =     0.0197
                                                Complete DF       =       7791
DF adjustment:   Large sample                   DF:     min       =  23,338.38
                                                        avg       =   1.11e+10
                                                        max       =   1.86e+11
Model F test:       Equal FMI                   F(  24, 2.5e+07)  =       6.54
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
  growth_vel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mage |  -.0635312   .0207933    -3.06   0.002    -.1042854   -.0227771
        gage |  -.0163823   .0272971    -0.60   0.548    -.0698851    .0371205
             |
         sex |
     female  |  -.6693951   .1005128    -6.66   0.000    -.8663968   -.4723935
             |
      m_edu4 |
1-4/Liter~e  |   .1898492   .1945606     0.98   0.329    -.1914838    .5711821
       5-10  |   .1513489   .1474621     1.03   0.305    -.1376725    .4403704
       >=11  |    .447122   .2036304     2.20   0.028     .0480119     .846232
             |
      f_edu4 |
1-4/Liter~e  |   .0203543   .1789542     0.11   0.909    -.3303898    .3710983
       5-10  |   .2800302   .1531566     1.83   0.067    -.0201528    .5802131
       >=11  |   .2093612     .18836     1.11   0.266    -.1598185     .578541
             |
       para5 |
    1 child  |   .3221857   .1317327     2.45   0.014     .0639944     .580377
 2 children  |     .15058    .179714     0.84   0.402    -.2016529     .502813
 3 children  |  -.1529509   .2503133    -0.61   0.541    -.6435561    .3376542
>=4 child..  |   .0838556    .385989     0.22   0.828    -.6726691    .8403802
             |
     prev_st |
         no  |   .2791445   .2155022     1.30   0.195    -.1432321    .7015211
             |
        hypo |
         no  |   -.206105   .2956631    -0.70   0.486     -.785594     .373384
             |
        conj |
         no  |  -.7056024    .537294    -1.31   0.189    -1.758679    .3474744
             |
        hemo |
         no  |   .9882649   .7849916     1.26   0.208    -.5502904     2.52682
             |
      fdpr_m |
         no  |   .6079604   .2691319     2.26   0.024     .0804717    1.135449
             |
      fdpr_b |
         no  |   .5517163   .2071086     2.66   0.008     .1457909    .9576416
             |
        jaun |
         no  |  -.4572317   .3915473    -1.17   0.243     -1.22465     .310187
             |
         pnm |
         no  |  -.9426035   .4473442    -2.11   0.035    -1.819382    -.065825
             |
        twin |
         no  |   .7309588   .5641192     1.30   0.195    -.3746945    1.836612
n_preg_vis~s |   .0532986    .051303     1.04   0.299    -.0472536    .1538507
  year_birth |   .0430663   .0182983     2.35   0.019     .0072005    .0789321
       _cons |  -76.78255   36.46365    -2.11   0.035    -148.2537   -5.311398
------------------------------------------------------------------------------

. 
. esttab gvel_regtable gvel_regtable_gage mi_gvel_morb mi_gvel mi_gvel_gage usi
> ng gvel_regtable.rtf,se replace
(note: file gvel_regtable.rtf not found)
(output written to gvel_regtable.rtf)

. 
. 
. save data/imputed_velocity_data.dta, replace
(note: file data/imputed_velocity_data.dta not found)
file data/imputed_velocity_data.dta saved

. 
. *Check VIF for multicollinearity
. mi convert flong

. mivif
mi estimate not allowed with mivif
r(198);

end of do-file
r(198);
