-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/rayansud/SEARCH/logs/multivar.log
  log type:  text
 opened on:   9 Jun 2021, 00:16:19

. 
. **Computing complete-case regression table
. 
. eststo cca:reg chwt_128 sex mage i.m_edu4 i.f_edu4 i.para5 prev_st hypo conj 
> hemo fdpr_m fdpr_b jaun pnm twin n_preg_visits year_birth wt1,vce(robust)

Linear regression                               Number of obs     =      7,608
                                                F(24, 7583)       =      16.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0515
                                                Root MSE          =     290.19

------------------------------------------------------------------------------
             |               Robust
    chwt_128 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |   -66.7591   6.704109    -9.96   0.000    -79.90101   -53.61719
        mage |  -4.307175   1.409306    -3.06   0.002    -7.069805   -1.544546
             |
      m_edu4 |
1-4/Liter~e  |   22.13546   13.18294     1.68   0.093    -3.706756    47.97767
       5-10  |   25.32545   9.740791     2.60   0.009     6.230805     44.4201
       >=11  |   65.60357   13.67421     4.80   0.000     38.79833    92.40881
             |
      f_edu4 |
1-4/Liter~e  |   1.749801   11.92352     0.15   0.883    -21.62359    25.12319
       5-10  |   20.68759   10.05441     2.06   0.040     .9781694    40.39701
       >=11  |   31.84092   12.58095     2.53   0.011     7.178775    56.50306
             |
       para5 |
    1 child  |   54.88551   8.873416     6.19   0.000     37.49116    72.27986
 2 children  |   51.30092   12.40569     4.14   0.000     26.98233     75.6195
 3 children  |    33.6621   17.29817     1.95   0.052    -.2471035     67.5713
>=4 child..  |   59.68682   27.03632     2.21   0.027     6.688153    112.6855
             |
     prev_st |   33.66539   14.42106     2.33   0.020     5.396125    61.93466
        hypo |   36.46423    17.4752     2.09   0.037     2.208005    70.72045
        conj |  -41.23069   35.91878    -1.15   0.251    -111.6414    29.18006
        hemo |   53.12746   50.24631     1.06   0.290    -45.36922    151.6241
      fdpr_m |   42.04081   17.85606     2.35   0.019     7.037979    77.04363
      fdpr_b |   80.12839   13.05071     6.14   0.000     54.54539    105.7114
        jaun |  -39.75189   27.51008    -1.44   0.149    -93.67926    14.17547
         pnm |  -73.06534   29.63767    -2.47   0.014    -131.1634    -14.9673
        twin |    175.024    29.5684     5.92   0.000     117.0618    232.9863
n_preg_vis~s |   7.348965   3.386473     2.17   0.030     .7105401    13.98739
  year_birth |   3.357075   1.193487     2.81   0.005      1.01751     5.69664
         wt1 |  -18.78902     9.4056    -2.00   0.046     -37.2266   -.3514354
       _cons |  -6287.828   2382.761    -2.64   0.008     -10958.7   -1616.956
------------------------------------------------------------------------------

. eststo cca_gage:reg chwt_128 sex mage i.m_edu4 i.f_edu4 i.para5 prev_st hypo 
> conj hemo fdpr_m fdpr_b jaun pnm twin n_preg_visits year_birth wt1 gage,vce(r
> obust)

Linear regression                               Number of obs     =      7,538
                                                F(25, 7512)       =      17.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0579
                                                Root MSE          =     288.88

------------------------------------------------------------------------------
             |               Robust
    chwt_128 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |   -67.1031   6.713992    -9.99   0.000     -80.2644    -53.9418
        mage |  -4.171478   1.399303    -2.98   0.003    -6.914503   -1.428452
             |
      m_edu4 |
1-4/Liter~e  |   26.07151   13.24202     1.97   0.049      .113449    52.02957
       5-10  |   25.90919   9.742893     2.66   0.008     6.810394    45.00799
       >=11  |   66.12432   13.68387     4.83   0.000     39.30011    92.94854
             |
      f_edu4 |
1-4/Liter~e  |   1.535356   11.97537     0.13   0.898    -21.93972    25.01043
       5-10  |   21.99187   10.07108     2.18   0.029      2.24974    41.73401
       >=11  |    35.7378   12.59518     2.84   0.005     11.04773    60.42787
             |
       para5 |
    1 child  |   54.92893   8.854912     6.20   0.000     37.57082    72.28703
 2 children  |   53.71403   12.42105     4.32   0.000      29.3653    78.06277
 3 children  |   35.57852   17.35735     2.05   0.040      1.55326    69.60377
>=4 child..  |    62.3152   27.40047     2.27   0.023     8.602616    116.0278
             |
     prev_st |   34.13379   14.43356     2.36   0.018     5.839961    62.42761
        hypo |   36.68764   17.41216     2.11   0.035     2.554934    70.82035
        conj |  -32.37403   34.28502    -0.94   0.345    -99.58226    34.83419
        hemo |   58.10419   50.41428     1.15   0.249     -40.7219    156.9303
      fdpr_m |   46.88095   17.49674     2.68   0.007     12.58244    81.17946
      fdpr_b |   74.25477    12.9363     5.74   0.000       48.896    99.61354
        jaun |  -33.08551   27.07304    -1.22   0.222    -86.15624    19.98523
         pnm |   -72.0409   29.58567    -2.43   0.015    -130.0371   -14.04471
        twin |   172.4131   29.24347     5.90   0.000     115.0877    229.7385
n_preg_vis~s |   7.171145   3.386479     2.12   0.034     .5326991    13.80959
  year_birth |   3.341768   1.186009     2.82   0.005     1.016859    5.666677
         wt1 |  -38.44581   9.803339    -3.92   0.000    -57.66309   -19.22852
        gage |   12.82576   1.783317     7.19   0.000     9.329954    16.32156
       _cons |  -6736.795   2368.235    -2.84   0.004     -11379.2   -2094.392
------------------------------------------------------------------------------

. 
. 
. 
. *Check normality of residuals
. predict r, resid
(278 missing values generated)

. kdensity r, normal title("Regression Residuals Normality")

. graph export graphs/norm_resid.eps,replace
(file graphs/norm_resid.eps written in EPS format)

. 
. *Check VIF 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
         sex |      1.02    0.983898
        mage |      1.91    0.523100
      m_edu4 |
          1  |      1.25    0.801300
          2  |      2.19    0.457277
          3  |      2.17    0.460654
      f_edu4 |
          1  |      1.52    0.659337
          2  |      2.33    0.429405
          3  |      2.59    0.385557
       para5 |
          1  |      1.58    0.631735
          2  |      1.86    0.536927
          3  |      1.56    0.642267
          4  |      1.42    0.706391
     prev_st |      1.12    0.895140
        hypo |      1.08    0.921908
        conj |      1.33    0.753539
        hemo |      1.01    0.994325
      fdpr_m |      1.05    0.950141
      fdpr_b |      1.10    0.906589
        jaun |      1.32    0.757419
         pnm |      1.00    0.995592
        twin |      1.04    0.957536
n_preg_vis~s |      1.19    0.841264
  year_birth |      1.37    0.728557
         wt1 |      1.25    0.800784
        gage |      1.12    0.893846
-------------+----------------------
    Mean VIF |      1.46

. 
. *****Imputation adjusted regression
. mdesc

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
           srno |           0          7,816           0.00
         bplace |           0          7,816           0.00
         grav_m |          74          7,816           0.95
         grav_d |           0          7,816           0.00
            dt1 |           3          7,816           0.04
            wt1 |           0          7,816           0.00
            dt7 |          16          7,816           0.20
            wt7 |         750          7,816           9.60
           dt15 |          22          7,816           0.28
           wt15 |         326          7,816           4.17
           dt28 |           4          7,816           0.05
           wt28 |           0          7,816           0.00
         reg_dt |           3          7,816           0.04
           mage |          14          7,816           0.18
          m_edu |          19          7,816           0.24
          f_edu |          43          7,816           0.55
           grav |          10          7,816           0.13
           para |           0          7,816           0.00
            lmp |          76          7,816           0.97
        prev_st |           0          7,816           0.00
         dt_hv1 |       1,302          7,816          16.66
         dt_hv2 |       1,891          7,816          24.19
         dt_hv3 |       4,721          7,816          60.40
            sex |           9          7,816           0.12
          still |           0          7,816           0.00
           twin |           0          7,816           0.00
        bi_asph |           0          7,816           0.00
           cong |           0          7,816           0.00
        neo_sep |           0          7,816           0.00
           hemo |           0          7,816           0.00
           conj |           0          7,816           0.00
            bsi |           0          7,816           0.00
         abjaun |           0          7,816           0.00
           jaun |           0          7,816           0.00
            pnm |           0          7,816           0.00
            uri |           0          7,816           0.00
           hypo |           0          7,816           0.00
        umb_sep |           0          7,816           0.00
          u_fev |           0          7,816           0.00
         fdpr_m |           0          7,816           0.00
         fdpr_b |           0          7,816           0.00
       dt_birth |         139          7,816           1.78
         fpr_d1 |           0          7,816           0.00
          hr_d1 |       4,722          7,816          60.41
     year_birth |         139          7,816           1.78
          wt1_g |           0          7,816           0.00
          wt7_g |         750          7,816           9.60
         wt15_g |         326          7,816           4.17
         wt28_g |           0          7,816           0.00
        chwt_17 |         750          7,816           9.60
       chwt_715 |         885          7,816          11.32
      chwt_1528 |         326          7,816           4.17
       chwt_128 |           0          7,816           0.00
     growth_vel |           0          7,816           0.00
           gage |          74          7,816           0.95
         m_edu4 |          19          7,816           0.24
         f_edu4 |          43          7,816           0.55
          grav4 |          10          7,816           0.13
          para5 |           0          7,816           0.00
         d_mage |          14          7,816           0.18
         d_gage |          74          7,816           0.95
   n_preg_vis~s |           0          7,816           0.00
   morbidity_~m |           0          7,816           0.00
       _est_cca |           0          7,816           0.00
   _est_cca_g~e |           0          7,816           0.00
              r |         278          7,816           3.56
----------------+-----------------------------------------------

. 
. mi set mlong

. mi register imputed chwt_128 mage gage sex m_edu4 f_edu4 para5 prev_st hypo c
> onj hemo fdpr_m fdpr_b jaun pnm twin wt1 n_preg_visits year_birth
(278 m=0 obs. now marked as incomplete)

. 
. mi impute chained (regress) chwt_128 year_birth wt1 mage gage (logit) sex pre
> v_st hypo jaun conj fdpr_m fdpr_b pnm twin (mlogit) m_edu4 f_edu4 (ologit) pa
> ra5 n_preg_visits,add(20) rseed(12345) augment
note: variables chwt_128 wt1 prev_st hypo jaun conj fdpr_m fdpr_b pnm twin
      para5 n_preg_visits contain no soft missing (.) values; imputing
      nothing

Conditional models:
               sex: logit sex chwt_128 wt1 i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     mage i.m_edu4 i.f_edu4 gage year_birth , augment
              mage: regress mage chwt_128 wt1 i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex i.m_edu4 i.f_edu4 gage year_birth
            m_edu4: mlogit m_edu4 chwt_128 wt1 i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex mage i.f_edu4 gage year_birth , augment
            f_edu4: mlogit f_edu4 chwt_128 wt1 i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex mage i.m_edu4 gage year_birth , augment
              gage: regress gage chwt_128 wt1 i.prev_st i.hypo i.jaun i.conj
                     i.fdpr_m i.fdpr_b i.pnm i.twin i.para5 i.n_preg_visits
                     i.sex mage i.m_edu4 i.f_edu4 year_birth
        year_birth: regress year_birth chwt_128 wt1 i.prev_st i.hypo i.jaun
                     i.conj i.fdpr_m i.fdpr_b i.pnm i.twin i.para5
                     i.n_preg_visits i.sex mage i.m_edu4 i.f_edu4 gage

Performing chained iterations ...

Multivariate imputation                     Imputations =       20
Chained equations                                 added =       20
Imputed: m=1 through m=20                       updated =        0

Initialization: monotone                     Iterations =      200
                                                burn-in =       10

          chwt_128: linear regression
        year_birth: linear regression
               wt1: linear regression
              mage: linear regression
              gage: linear regression
               sex: logistic regression
           prev_st: logistic regression
              hypo: logistic regression
              jaun: logistic regression
              conj: logistic regression
            fdpr_m: logistic regression
            fdpr_b: logistic regression
               pnm: logistic regression
              twin: logistic regression
            m_edu4: multinomial logistic regression
            f_edu4: multinomial logistic regression
             para5: ordered logistic regression
     n_preg_visits: ordered logistic regression

------------------------------------------------------------------
                   |               Observations per m             
                   |----------------------------------------------
          Variable |   Complete   Incomplete   Imputed |     Total
-------------------+-----------------------------------+----------
          chwt_128 |       7816            0         0 |      7816
        year_birth |       7677          139       139 |      7816
               wt1 |       7816            0         0 |      7816
              mage |       7802           14        14 |      7816
              gage |       7742           74        74 |      7816
               sex |       7807            9         9 |      7816
           prev_st |       7816            0         0 |      7816
              hypo |       7816            0         0 |      7816
              jaun |       7816            0         0 |      7816
              conj |       7816            0         0 |      7816
            fdpr_m |       7816            0         0 |      7816
            fdpr_b |       7816            0         0 |      7816
               pnm |       7816            0         0 |      7816
              twin |       7816            0         0 |      7816
            m_edu4 |       7797           19        19 |      7816
            f_edu4 |       7773           43        43 |      7816
             para5 |       7816            0         0 |      7816
     n_preg_visits |       7816            0         0 |      7816
------------------------------------------------------------------
(complete + incomplete = total; imputed is the minimum across m
 of the number of filled-in observations.)

. 
. eststo mi_o: mi estimate,nosmall post: reg chwt_128 sex mage wt1 i.m_edu4 i.f
> _edu4 i.para5 prev_st hypo conj hemo fdpr_m fdpr_b jaun pnm twin n_preg_visit
> s year_birth,vce(robust)

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      7,816
                                                Average RVI       =     0.0017
                                                Largest FMI       =     0.0131
                                                Complete DF       =       7791
DF adjustment:   Large sample                   DF:     min       = 111,241.01
                                                        avg       =   4.30e+10
                                                        max       =   9.25e+11
Model F test:       Equal FMI                   F(  24, 1.4e+08)  =      16.45
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
    chwt_128 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |   -66.6656   6.640844   -10.04   0.000    -79.68144   -53.64976
        mage |  -4.564896   1.393929    -3.27   0.001    -7.296947   -1.832844
         wt1 |  -18.49683   9.218241    -2.01   0.045    -36.56425   -.4294123
             |
      m_edu4 |
1-4/Liter~e  |   22.07217   12.90174     1.71   0.087    -3.214819    47.35916
       5-10  |   25.13355   9.600209     2.62   0.009     6.317474    43.94962
       >=11  |   64.40141   13.50624     4.77   0.000     37.92964    90.87317
             |
      f_edu4 |
1-4/Liter~e  |   1.010719    11.7917     0.09   0.932    -22.10063    24.12207
       5-10  |   21.36039   9.933471     2.15   0.032     1.891131    40.82965
       >=11  |    33.2402    12.4612     2.67   0.008     8.816672    57.66373
             |
       para5 |
    1 child  |   55.82284   8.775931     6.36   0.000     38.62233    73.02335
 2 children  |   52.51551   12.16944     4.32   0.000     28.66384    76.36718
 3 children  |   36.52176     16.957     2.15   0.031      3.28665    69.75688
>=4 child..  |   50.93934   26.90387     1.89   0.058    -1.791276      103.67
             |
     prev_st |   33.06102   14.26967     2.32   0.021     5.092973    61.02906
        hypo |   30.75067   17.06432     1.80   0.072    -2.694777    64.19612
        conj |  -42.91778   35.43728    -1.21   0.226    -112.3736    26.53802
        hemo |   68.98884   48.84988     1.41   0.158    -26.75518    164.7328
      fdpr_m |   39.41081   17.33862     2.27   0.023     5.427749    73.39387
      fdpr_b |   81.07626   12.97786     6.25   0.000     55.64012    106.5124
        jaun |  -40.18902    27.3536    -1.47   0.142    -93.80109    13.42306
         pnm |  -65.79378   29.04403    -2.27   0.023     -122.719   -8.868532
        twin |   174.8983   29.54452     5.92   0.000     116.9921    232.8045
n_preg_vis~s |   7.028804    3.34131     2.10   0.035     .4799556    13.57765
  year_birth |   3.270151   1.184763     2.76   0.006     .9480328     5.59227
       _cons |  -6121.953   2365.301    -2.59   0.010    -10757.91   -1485.998
------------------------------------------------------------------------------

. 
. eststo mi_gage: mi estimate,nosmall post: reg chwt_128 sex mage  gage wt1 i.m
> _edu4 i.f_edu4 i.para5 prev_st hypo conj hemo fdpr_m fdpr_b jaun pnm twin n_p
> reg_visits year_birth,vce(robust)

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      7,816
                                                Average RVI       =     0.0022
                                                Largest FMI       =     0.0135
                                                Complete DF       =       7790
DF adjustment:   Large sample                   DF:     min       = 105,018.79
                                                        avg       =   3.97e+09
                                                        max       =   7.28e+10
Model F test:       Equal FMI                   F(  25, 9.4e+07)  =      17.91
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
    chwt_128 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |  -68.48398   6.620795   -10.34   0.000    -81.46053   -55.50744
        mage |  -4.524888   1.383399    -3.27   0.001      -7.2363   -1.813475
        gage |   13.03364    1.75684     7.42   0.000     9.590263    16.47701
         wt1 |  -37.80832   9.563768    -3.95   0.000    -56.55296   -19.06368
             |
      m_edu4 |
1-4/Liter~e  |    25.4379    12.8614     1.98   0.048     .2299735    50.64583
       5-10  |   25.48716   9.573389     2.66   0.008     6.723655    44.25067
       >=11  |   64.62544   13.44965     4.80   0.000      38.2646    90.98628
             |
      f_edu4 |
1-4/Liter~e  |   1.129117   11.76464     0.10   0.924    -21.92918    24.18741
       5-10  |   22.38948   9.913183     2.26   0.024      2.95999    41.81898
       >=11  |    35.8202   12.42227     2.88   0.004     11.47297    60.16742
             |
       para5 |
    1 child  |    56.7925   8.740271     6.50   0.000     39.66188    73.92312
 2 children  |   53.70759    12.1301     4.43   0.000     29.93303    77.48215
 3 children  |   40.86115   16.91641     2.42   0.016     7.705596     74.0167
>=4 child..  |    53.7755   26.81464     2.01   0.045     1.219778    106.3312
             |
     prev_st |   31.99784    14.1775     2.26   0.024      4.21045    59.78523
        hypo |    28.1356    16.9163     1.66   0.096    -5.019726    61.29093
        conj |  -45.03524   35.43183    -1.27   0.204    -114.4804    24.40986
        hemo |   76.19451   49.30306     1.55   0.122    -20.43771    172.8267
      fdpr_m |   41.48285   17.27417     2.40   0.016     7.626095     75.3396
      fdpr_b |   75.73198   12.89325     5.87   0.000     50.46167    101.0023
        jaun |  -38.68678   27.43082    -1.41   0.158     -92.4502    15.07663
         pnm |  -66.75486   28.79426    -2.32   0.020    -123.1906   -10.31915
        twin |   172.9955   28.95295     5.98   0.000     116.2488    229.7422
n_preg_vis~s |   6.835454   3.328931     2.05   0.040     .3108684    13.36004
  year_birth |   3.310967   1.179107     2.81   0.005     .9999322    5.622001
       _cons |  -6667.497   2353.183    -2.83   0.005     -11279.7   -2055.291
------------------------------------------------------------------------------

. 
. eststo mi_morb: mi estimate,nosmall post: reg chwt_128 sex mage  gage wt1 i.m
> _edu4 i.f_edu4 i.para5 morbidity_num n_preg_visits year_birth,vce(robust)

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      7,816
                                                Average RVI       =     0.0030
                                                Largest FMI       =     0.0128
                                                Complete DF       =       7798
DF adjustment:   Large sample                   DF:     min       = 116,558.78
                                                        avg       =   3.28e+07
                                                        max       =   2.07e+08
Model F test:       Equal FMI                   F(  17, 3.1e+07)  =      20.77
Within VCE type:       Robust                   Prob > F          =     0.0000

------------------------------------------------------------------------------
    chwt_128 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sex |  -68.62445   6.653017   -10.31   0.000    -81.66415   -55.58475
        mage |  -4.562378   1.392822    -3.28   0.001    -7.292258   -1.832498
        gage |   13.47707   1.771404     7.61   0.000     10.00515    16.94899
         wt1 |  -24.29939   9.418475    -2.58   0.010    -42.75926   -5.839513
             |
      m_edu4 |
1-4/Liter~e  |   24.80394   13.02453     1.90   0.057    -.7237125    50.33158
       5-10  |   25.74878   9.598722     2.68   0.007     6.935623    44.56194
       >=11  |   65.40328   13.47362     4.85   0.000     38.99545    91.81112
             |
      f_edu4 |
1-4/Liter~e  |   3.069583   11.77046     0.26   0.794    -20.00013     26.1393
       5-10  |   23.29481    9.93954     2.34   0.019     3.813658    42.77596
       >=11  |   36.77749   12.45503     2.95   0.003     12.36604    61.18893
             |
       para5 |
    1 child  |   54.85533   8.704514     6.30   0.000     37.79479    71.91586
 2 children  |   48.89386   12.05881     4.05   0.000     25.25903     72.5287
 3 children  |   32.06689   16.56793     1.94   0.053      -.40566    64.53945
>=4 child..  |   37.33935   26.05845     1.43   0.152    -13.73427    88.41298
             |
morbidity_~m |   19.58292   3.885533     5.04   0.000     11.96741    27.19842
n_preg_vis~s |   6.972783   3.338482     2.09   0.037     .4294763    13.51609
  year_birth |   2.998041   1.183094     2.53   0.011     .6791952    5.316887
       _cons |  -6150.141   2358.987    -2.61   0.009    -10773.72   -1526.563
------------------------------------------------------------------------------

. 
. esttab cca mi_o cca_gage mi_gage mi_morb using tables/change_table.rtf
(output written to tables/change_table.rtf)

. 
. save data/imputed_change_data.dta, replace
(note: file data/imputed_change_data.dta not found)
file data/imputed_change_data.dta saved

. 
. *Check VIF for multicollinearity
. mi convert flong

. mivif
mi estimate not allowed with mivif
r(198);

end of do-file
r(198);
